p_flatPlate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            noSlip;
    }
    
    leftSide
    {
    	type		fixedValue; // generic condition
	value		uniform (1 0 0);
    }

    rightSide
    {
    	type		zeroGradient; // generic condition
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
